# 1. Базовый образ (Python 3.9 в легкой версии)
FROM python:3.9-slim

# 2. Рабочая директория внутри контейнера
WORKDIR /app

# 3. Копирование файлов проекта в контейнер
COPY . .

# 4. Установка зависимостей (если их нет, команда просто пройдет мимо)
# Если у тебя появится файл requirements.txt, раскомментируй строку ниже:
# RUN pip install --no-cache-dir -r requirements.txt

# 5. Команда запуска приложения
# Флаг -u нужен, чтобы видеть принты в логах Docker сразу
CMD ["python", "-u", "main.py"]
